USE dodram_db;

CREATE TABLE event (
    id INT AUTO_INCREMENT PRIMARY KEY,
    tab VARCHAR(20) NOT NULL,         -- ongoing / ended 등
    title VARCHAR(255) NOT NULL,      -- 이벤트 제목
    img VARCHAR(255) NOT NULL,        -- 이미지 파일명
    alt VARCHAR(100),                  -- 이미지 alt
    date VARCHAR(50),                  -- 이벤트 기간
    content TEXT,                       -- 상세 내용
    create_time DATETIME DEFAULT CURRENT_TIMESTAMP,
	view_count INT DEFAULT 0
);
INSERT INTO event(tab,title,img,alt,date,content) VALUES
('ended','선물하셨나요? 도드람몰이 선물드립니다!','banner.jpg','선물','2026.01.05 00:00 ~ 2026.01.31 00:00','<p>도드람몰에서 선물 증정 이벤트 진행 중!</p>'),
('ended','유튜브속 도드람, 시원한 특가','b21576fbb2bba006203.jpg','유튜브','2025.08.06 00:00 ~ 2025.08.19 00:00','<p>도드람 유튜브 특가 상품을 확인하세요.</p>'),
('ended','[사은품 증정] 이건 받아야해! 여름 보냉백','1eeb1168e71f20534dad5740dbbe9573.jpg','보냉팩','2025.07.29 00:00 ~ 2025.08.31 00:00','<p>여름 보냉백 사은품 증정 이벤트!</p>'),
('ended','도드람 복날 보양식 할인 이벤트','ed5d89e0ff60b039b5b063446086685a.jpg','복날','2025.07.17 00:00 ~ 2025.07.30 00:00','<p>복날 한돈 보양식 할인 행사</p>'),
('ended','🔥 도드람 캠핑마켓 OPEN 🔥','aa59fefbe152eb9c87f2547a0e86a6db.jpg','캠핑마켓','2025.07.01 00:00 ~ 2025.07.09 00:00','<p>캠핑마켓 오픈! 다양한 상품 특가 판매</p>'),
('ended','🐽 삼겹살데이 할인행사 🐽','1758c8a5caff67f92701095f0160158b.png','삼겹살데이','2025.02.24 00:00 ~ 2025.03.09 00:00','<p>삼겹살데이 맞이 한돈 할인 이벤트</p>'),
('ended','💗도드람 창립34주년 기념 할인행사💗','a4a0f38abfabae8c951.png','창립34주년','2024.10.07 00:00 ~ 2024.10.20 00:00','<p>도드람 창립 34주년 기념 할인 행사!</p>'),
('ended','🌴GO SURFYY FIND DODRAM🌴','64bb8f4db07f8c14a0be547dfccd8557.jpg','피서','2024.06.21 00:00 ~ 2024.06.30 23:59','<p>여름 피서 이벤트, 한돈 특가 상품!</p>'),
('ended','도드람 캔돈 어택!','e29263183bc61354ed41ecbc83a91c37_172511.jpg','캔돈','2024.06.11 00:00 ~ 2024.06.16 23:59','<p>도드람 캔돈 이벤트 진행</p>'),
('ended','[EVENT] 도드람 유튜브 빅꿀잼 퀴즈 이벤트','e5fc2567e9ae2b26b9c4d24a78edafad.jpg','유튜브퀴즈','2024.05.10 00:00 ~ 2024.05.15 23:59','<p>유튜브 퀴즈 이벤트! 경품 증정</p>'),
('ended','가정의 달 선물네컷 추천!','65aefc273ade8cc4b610c67311200ae8.jpg','가정의달','2024.05.07 00:00 ~ 2024.05.31 23:59','<p>가정의 달 선물 추천 이벤트</p>'),
('ended','SSG랜더스필드의 도드람 스카이박스 가는거 어때요?','7e073f4e2e04730f911552e5a87b4abb_140735.jpg','스카이박스','2024.04.26 00:00 ~ 2024.05.06 00:00','<p>SSG 랜더스필드 스카이박스 이벤트 안내</p>'),
('ended','도드람한돈 벚꽃 에디션 출시','8c04003e48d5a949662.png','벚꽃에디션','2024.03.24 00:00 ~ 2024.04.30 00:00','<p>벚꽃 에디션 출시 기념 이벤트</p>'),
('ended','肉월에는 고기반찬','4bde6c63dee14c9c.png','고기반찬','2021.06.07 00:00 ~ 2021.06.21 23:59','<p>肉월 맞이 고기반찬 특가 이벤트</p>'),
('ended','특수부위 3종 금주특가','4d02603a5f350f11.png','특수부위','2021.05.11 00:00 ~ 2021.05.18 23:59','<p>특수부위 3종 금주특가 행사</p>'),
('ended','도드람몰 연말 랭킹쇼! 인기상품 총 결산 할인','9b7736919ed74f22.png','연말랭킹','2020.12.07 00:00 ~ 2020.12.31 00:00','<p>연말 랭킹쇼, 인기상품 총 결산 할인 이벤트</p>');